app/views/users/index.html.erb

              <td><%= user.name %></td>
              <td><p>フォロー数：<%= user.following_user.count %></p></td>
---
SELECT "users".* FROM "users"