app/views/books/show.html.erb

                      <%= link_to book_favorites_path(@books.id), method: :delete do %>
                        ♥<%= @books.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                      <%= link_to book_favorites_path(@books.id), method: :post do %>
                        ♡<%= @books.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                  </td>
                  <td><p>コメント件数：<%= @books.book_comments.count %></p></td>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

          </table>
          <% @books.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]