app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?, ?)  [["comment", "ww"], ["user_id", 4], ["created_at", "2021-05-03 07:02:51.097775"], ["updated_at", "2021-05-03 07:02:51.097775"], ["book_id", 2]]
---
  def create
    @book_comment = BookComment.new
    @book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = @book.id
    comment.save

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 3]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 3], ["book_id", 3], ["LIMIT", 1]]
---
  def destroy
    BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy