app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @books = Book.find(params[:id])

INSERT INTO "books" ("title", "user_id", "created_at", "updated_at", "body") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["user_id", 4], ["created_at", "2021-05-03 07:11:41.776298"], ["updated_at", "2021-05-03 07:11:41.776298"], ["body", "yyyy"]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save