app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @book = Book.new
    @user = current_user
    @users = User.all